# learnPandas

In [10]:
%%javascript
// JAVASCRIPT CONETENTS
setTimeout(function(){
$(":header").each(function(i){ 
    var level = this.tagName[1]
    var buffer = ""
    for(var j = 0;j <= level; j++){

        buffer += "  "
    }
    buffer += "- "
    console.log(buffer)
    element.append("<code>"+ buffer + "</code>" + "<a href=#" + this.id + ">" + this.innerText + "</a><br>"); 
})
    },100);

## Resources 

https://pandas.pydata.org/pandas-docs/stable/10min.html

## Basic Data Structures

 - Series
 - DataFrames
 - Panels (collection of DataFrames)

## Imports

In [2]:
import pandas as pd
import numpy as np

## Example Series, Daterange index and Dataframe

In [3]:
s = pd.Series([1,3,5,np.nan,6,8])
dates = pd.date_range('01/01/2017', periods=8,freq='D')
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])

### Create from Dictionary
df2 = pd.DataFrame({"A":1,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo'
                   })

## Inspecting DataFrame

### head

In [100]:
df.head(n=2)

                   A         B         C         D
2017-01-01  0.646663 -1.205007  1.716421  1.369106
2017-01-02  0.025591  0.877796  0.910266  1.146696

### tail

In [101]:
df.tail(n=1)

                   A         B         C         D
2017-01-08 -0.182667  2.155683 -0.394196  1.202636

### describe

In [102]:
df.describe()

              A         B         C         D
count  8.000000  8.000000  8.000000  8.000000
mean  -0.116999  0.081885  0.438809  0.664531
std    0.611673  1.431890  1.019451  0.546329
min   -1.033983 -1.490327 -1.520395 -0.232932
25%   -0.341018 -1.200150  0.015736  0.342929
50%   -0.140943 -0.058042  0.706083  0.591660
75%    0.180859  1.066233  1.070669  1.160681
max    0.706361  2.155683  1.716421  1.369106

### info

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 8 entries, 2017-01-01 to 2017-01-08
Freq: D
Data columns (total 4 columns):
A    8 non-null float64
B    8 non-null float64
C    8 non-null float64
D    8 non-null float64
dtypes: float64(4)
memory usage: 320.0 bytes

### columns

In [104]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

### index

In [105]:
df.index

#print(xxxxx, end='\n\n',sep="\n")

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08'],
              dtype='datetime64[ns]', freq='D')

 <br>

## Selecting

### Select a Column (series type)

In [6]:
df['A']

2017-01-01    0.553816
2017-01-02   -1.881390
2017-01-03    1.263598
2017-01-04   -0.116428
2017-01-05    0.540594
2017-01-06   -0.076434
2017-01-07   -0.008625
2017-01-08    0.815691
Freq: D, Name: A, dtype: float64

### Select a Row slice

In [7]:
df[1:2]

                  A         B         C         D
2017-01-02 -1.88139  0.903677  0.544948  0.701386

### Select by label - df.loc

In [8]:
# Selecting by multiaxis labels
df.loc[:dates[3],'B':'D']

                   B         C         D
2017-01-01 -0.140407  0.388797  1.218023
2017-01-02  0.903677  0.544948  0.701386
2017-01-03  0.568267  0.188811  1.217801
2017-01-04 -1.431660 -0.296315  0.544546

In [9]:
# Selecting a row (returns series)
df.loc[dates[3],:]

A   -0.116428
B   -1.431660
C   -0.296315
D    0.544546
Name: 2017-01-04 00:00:00, dtype: float64

### Select by Position - df.iloc

In [10]:
# Select multiple axis position
df.iloc[3:5,2:]

                   C         D
2017-01-04 -0.296315  0.544546
2017-01-05  0.095999  1.652025

### Boolean indexing

In [5]:
# Select by logical condition
df[df.A > 0]

                   A         B         C         D
2017-01-01  0.553816 -0.140407  0.388797  1.218023
2017-01-03  1.263598  0.568267  0.188811  1.217801
2017-01-05  0.540594 -0.007611  0.095999  1.652025
2017-01-08  0.815691 -0.545111 -1.884911  1.456049

In [75]:
df.iloc[3:5,2:]

                   C         D
2017-01-04  0.837601  0.003778
2017-01-05 -0.348577 -0.785986

### isin

In [86]:
# Adding a column
df['E'] = [1,2,3,4,5,6,7,8] 
df[df['E'].isin([3,4])]

                   A         B         C         D  E
2017-01-03  1.263598  0.568267  0.188811  1.217801  3
2017-01-04 -0.116428 -1.431660 -0.296315  0.544546  4

<br>

## Missing Data

### dropna

In [125]:
df.loc[dates[0]:dates[3],'F'] = 20
df.dropna()

                   A         B         C         D  E     F
2017-01-01  4.000000 -0.140407  0.388797  1.218023  1  20.0
2017-01-02 -1.881390  0.903677  0.544948  0.701386  2  20.0
2017-01-03  1.263598  0.568267  0.188811  1.217801  3  20.0
2017-01-04 -0.116428 -1.431660 -0.296315  0.544546  4  20.0
2017-01-05  0.540594 -0.007611  0.095999  1.652025  5  20.0

### fillna

In [128]:
df.fillna(value=30)
# note - these operations follow an immutable pattern

                   A         B         C         D  E     F
2017-01-01  4.000000 -0.140407  0.388797  1.218023  1  20.0
2017-01-02 -1.881390  0.903677  0.544948  0.701386  2  20.0
2017-01-03  1.263598  0.568267  0.188811  1.217801  3  20.0
2017-01-04 -0.116428 -1.431660 -0.296315  0.544546  4  20.0
2017-01-05  0.540594 -0.007611  0.095999  1.652025  5  20.0
2017-01-06 -0.076434 -0.391564  1.175721 -0.022289  6  30.0
2017-01-07 -0.008625  0.824923 -0.770727  0.841470  7  30.0
2017-01-08  0.815691 -0.545111 -1.884911  1.456049  8  30.0

### isnull

In [131]:
pd.isnull(df)

                A      B      C      D      E      F
2017-01-01  False  False  False  False  False  False
2017-01-02  False  False  False  False  False  False
2017-01-03  False  False  False  False  False  False
2017-01-04  False  False  False  False  False  False
2017-01-05  False  False  False  False  False  False
2017-01-06  False  False  False  False  False   True
2017-01-07  False  False  False  False  False   True
2017-01-08  False  False  False  False  False   True

## Reshaping

### Dropping column

In [110]:
# make a silly column
df[dates[0],'A']  = 4

In [111]:
df

,A,B,C,D,E,"(2017-01-01 00:00:00, A)"
2017-01-01,4.000000,-0.140407,0.388797,1.218023,1,4
2017-01-02,-1.881390,0.903677,0.544948,0.701386,2,4
2017-01-03,1.263598,0.568267,0.188811,1.217801,3,4
2017-01-04,-0.116428,-1.431660,-0.296315,0.544546,4,4
2017-01-05,0.540594,-0.007611,0.095999,1.652025,5,4
2017-01-06,-0.076434,-0.391564,1.175721,-0.022289,6,4
2017-01-07,-0.008625,0.824923,-0.770727,0.841470,7,4
2017-01-08,0.815691,-0.545111,-1.884911,1.456049,8,4

In [115]:
# remove the silly column
df.drop(labels=df.columns[5],axis=1,inplace=True)

<br>

## Sorting

### Sort Using sort_index note inplace default is false

In [74]:
df.T

,2017-01-01 00:00:00,2017-01-02 00:00:00,2017-01-03 00:00:00,2017-01-04 00:00:00,2017-01-05 00:00:00,2017-01-06 00:00:00,2017-01-07 00:00:00,2017-01-08 00:00:00
A,0.553816,-1.881390,1.263598,-0.116428,0.540594,-0.076434,-0.008625,0.815691
B,-0.140407,0.903677,0.568267,-1.431660,-0.007611,-0.391564,0.824923,-0.545111
C,0.388797,0.544948,0.188811,-0.296315,0.095999,1.175721,-0.770727,-1.884911
D,1.218023,0.701386,1.217801,0.544546,1.652025,-0.022289,0.841470,1.456049

### Sort by Columns

In [75]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2017-01-01  1.218023  0.388797 -0.140407  0.553816
2017-01-02  0.701386  0.544948  0.903677 -1.881390
2017-01-03  1.217801  0.188811  0.568267  1.263598
2017-01-04  0.544546 -0.296315 -1.431660 -0.116428
2017-01-05  1.652025  0.095999 -0.007611  0.540594
2017-01-06 -0.022289  1.175721 -0.391564 -0.076434
2017-01-07  0.841470 -0.770727  0.824923 -0.008625
2017-01-08  1.456049 -1.884911 -0.545111  0.815691

### Sort by index column

In [76]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2017-01-08  0.815691 -0.545111 -1.884911  1.456049
2017-01-07 -0.008625  0.824923 -0.770727  0.841470
2017-01-06 -0.076434 -0.391564  1.175721 -0.022289
2017-01-05  0.540594 -0.007611  0.095999  1.652025
2017-01-04 -0.116428 -1.431660 -0.296315  0.544546
2017-01-03  1.263598  0.568267  0.188811  1.217801
2017-01-02 -1.881390  0.903677  0.544948  0.701386
2017-01-01  0.553816 -0.140407  0.388797  1.218023

### Sort by values

In [133]:
df.sort_values(by='B',ascending=False,axis=0)

                   A         B         C         D  E     F
2017-01-02 -1.881390  0.903677  0.544948  0.701386  2  20.0
2017-01-07 -0.008625  0.824923 -0.770727  0.841470  7   NaN
2017-01-03  1.263598  0.568267  0.188811  1.217801  3  20.0
2017-01-05  0.540594 -0.007611  0.095999  1.652025  5  20.0
2017-01-01  4.000000 -0.140407  0.388797  1.218023  1  20.0
2017-01-06 -0.076434 -0.391564  1.175721 -0.022289  6   NaN
2017-01-08  0.815691 -0.545111 -1.884911  1.456049  8   NaN
2017-01-04 -0.116428 -1.431660 -0.296315  0.544546  4  20.0

## Edit column width for Long Strings

In [7]:
pd.set_option('display.max_colwidth', 200)

pd.DataFrame({"Long String":"""Lorem ipsum dolor sit amet, consectetur adipiscing elit. 
Morbi sed tincidunt massa. Praesent iaculis molestie accumsan. 
Curabitur ac arcu sit amet nisi porta commodo. Praesent vel cursus urna. 
Nulla velit ante, laoreet ut velit sit amet, faucibus congue mi."""},index=range(1))

                                                                                                                                                                                               Long String
0  Lorem ipsum dolor sit amet, consectetur adipiscing elit. \nMorbi sed tincidunt massa. Praesent iaculis molestie accumsan. \nCurabitur ac arcu sit amet nisi porta commodo. Praesent vel cursus urna....

In [9]:
pd.set_option('display.max_colwidth', 50) # Default

pd.DataFrame({"Long String":"""Lorem ipsum dolor sit amet, consectetur adipiscing elit. 
Morbi sed tincidunt massa. Praesent iaculis molestie accumsan. 
Curabitur ac arcu sit amet nisi porta commodo. Praesent vel cursus urna. 
Nulla velit ante, laoreet ut velit sit amet, faucibus congue mi."""},index=range(1))

                                         Long String
0  Lorem ipsum dolor sit amet, consectetur adipis...

## Creating DataFrame from .csv

In [26]:
df3 = pd.read_csv('example.csv')

In [44]:
%%bash
pip install progressbar2

Requirement already satisfied: progressbar2 in /Users/simon.ward-jones/anaconda/lib/python3.6/site-packages
Requirement already satisfied: python-utils>=2.1.0 in /Users/simon.ward-jones/anaconda/lib/python3.6/site-packages (from progressbar2)
Requirement already satisfied: six in /Users/simon.ward-jones/anaconda/lib/python3.6/site-packages (from python-utils>=2.1.0->progressbar2)

In [45]:
import progressbar
bar = progressbar.ProgressBar(widgets=[progressbar.Percentage()])
for i in bar(range(20)):
    bar.update(i+1)
    sleep(0.1)

100%